{
	"title": "The Casino",
	"description": "A heist adventure CYOA by u/spanchob",
	"data": [
		{
			"type": "paragraph",
			"title": "Introduction",
			"description": [
				"You are a retired high class theif who has done many heists in the past. However recently you recieved an anonymous tip about a flaw in the security of the Balmoral Casino. Seeing the immense fortune that could be made you decide to put on the mask once more and do one final heist to end your career.",
				"You need to assemble a crew (of hot women, obviously) to assist you in your heist and to take care of your more baser needs. They are of course in it for the money and for your girthy cock. Each women provides stats that decide what ending you get.",
				"Desire is representative of the overall libido and greed of the crew. A high desire increases their effeciency and leads to more sex (Keep as high as possible)",
				"Stealth is representative of the skill of the crew. A high stealth value will ensure that the heist goes through successfully (Keep as high as possible)",
				"Loyalty is representative of how loyal your crew is. A loyal crew will follow your orders and lead to a successful heist (Keep as high as possible)",
				"Overall, maximise the DSL value for a successful heist.",
				"Should any trait be negative by the end, the heist will be considered a fail and you would get no harem."
			]
		},
		{
			"type": "choice",
			"title": "Partner",
			"description": "Your partner in crime and also your wife. Your partner helps plan the heist and keeps your crew in check, generally by punishing them with brutal sex or rewarding them with sensual pleasureful sex. Either way, you get to watch and if you want dish out some punishment or reward as well. You fuck her to sleep every night and live with her in your modern mansion. She gets 20% of the heist money.",
			"choices": [
				{
					"name": "Selena Gomez",
					"image": "SelenaGomez/3.jpg",
					"modifier": "+2 Desire",
					"perk": "Unlock Spy",
					"description": "Selena used to be your best friend's sister. A kleptonymphomaniac, she gets super horny by stealing things and needs a dick inside her everytime she steals something. Luckily for you, your dick is the one that helps keep her needs in check often. She often steals things from your neighbhors and brings them to you so that you may reward her with rough doggystyle sex."
				},
				{
					"name": "Victoria Justice",
					"image": "VictoriaJustice/2.jpg",
					"modifier": "+2 Skill",
					"perk": "Unlock Gymnast",
					"description": "Victoria was the former princess of the nation, who had to go into hiding after the revolution. Coming from a life of luxury, she wanted all of her wealth back and as such decided to steal things for a living. You first encountered her when you were stealing a jewel from the national treasury and you two instantly felt a connection. You both had sex right then and there, inside the treasury vault room."
				},
				{
					"name": "Penelope Cruz",
					"image": "PenelopeCruz/3.jpg",
					"modifier": "+2 Loyalty",
					"perk": "Unlock Dealer",
					"description": "Penelope was the housewife of a rich hollywood actor who was much older than her. When you were stealing valuable paintings from the actor's house, Penelope saw you. Instead of reporting you she told you where all the valuables were to get revenge on the actor who mistreated her. As a reward, you took her with you to your mansion and fucked her senseless. From then on, she has been your loyal wife and pet."
				}
			],
			"pick": 1
		},
		{
			"type": "choice",
			"title": "Spy",
			"description": "Selena suggested that you should inculde her spy friend, who helped her escape when her family was captured by the revolution, in the crew to spy on the owner. She would spy on the owner and give you all the ins and outs of the casino so that you can plan your heist better. To give you this information, she would come to your room as a hooker and spend the night with you so as to not arrouse any suspiscion, before leaving the information on a note in the morning. She gets 5% of the heist money.",
			"choices": [
				{
					"name": "Alice Eve",
					"image": "AliceEve/4.jpg",
					"modifier": "+1 Desire",
					"perk": "",
					"description": ""
				},
				{
					"name": "Lili Reinhart",
					"image": "LiliReinhart/3.jpg",
					"modifier": "+1 Skill",
					"perk": "",
					"description": ""
				},
				{
					"name": "Ana de Armas",
					"image": "AnadeArmas/9.jpg",
					"modifier": "+1 Loyalty",
					"perk": "",
					"description": ""
				}
			],
			"pick": 1,
			"condition": {
				"conditional": "intersect",
				"a": [
					"Partner.name"
				],
				"b": [
					"Selena Gomez"
				]
			}
		},
		{
			"type": "choice",
			"title": "Gymnast",
			"description": "Victoria suggested that you should include her gymnast friend in the crew. She would help enter and exit the vault without triggering any alarms. To test her skills, you and Selena ask her to strip and take up various positions. Eventually, after seeing her flexibility for a while you wanted to see how she is able to keep her cool under presure, by fucking her as she stretched. You and Selena then gave her a night she will remember forever, after which she agreed to join your crew. She gets 5% of the heist money",
			"choices": [
				{
					"name": "Summer Glau",
					"image": "SummerGlau/5.jpg",
					"modifier": "+1 Desire",
					"perk": "",
					"description": ""
				},
				{
					"name": "Violett Beane",
					"image": "ViolettBeane/2.jpg",
					"modifier": "+1 Skill",
					"perk": "",
					"description": ""
				},
				{
					"name": "Maisie Williams",
					"image": "MaisieWilliams/4.jpg",
					"modifier": "+1 Loyalty",
					"perk": "",
					"description": ""
				}
			],
			"pick": 1,
			"condition": {
				"conditional": "intersect",
				"a": [
					"Partner.name"
				],
				"b": [
					"Victoria Justice"
				]
			}
		},
		{
			"type": "choice",
			"title": "Dealer",
			"description": "Penelope suggests that you should seduce and include a dealer from the casino into your crew. You go to the casino under disguise and seduce a dealer. After giving her the best fuck of her life, you offer her to join your crew and reap the rewards. Blinded by her lust towards you, she joins the crew and agrees the distract the guards when your crew performs the heist. In exchange, you have to keep replenishing her lust by fucking her until she can't walk. She gets 5% of the heist money.",
			"choices": [
				{
					"name": "Lily Collins",
					"image": "LilyCollins/1.jpg",
					"modifier": "+1 Desire",
					"perk": "",
					"description": ""
				},
				{
					"name": "Zoey Deutch",
					"image": "ZoeyDeutch/2.jpg",
					"modifier": "+1 Skill",
					"perk": "",
					"description": ""
				},
				{
					"name": "Karen Gillian",
					"image": "KarenGillian/3.jpg",
					"modifier": "+1 Loyalty",
					"perk": "",
					"description": ""
				}
			],
			"pick": 1,
			"condition": {
				"conditional": "intersect",
				"a": [
					"Partner.name"
				],
				"b": [
					"Penelope Cruz"
				]
			}
		},
		{
			"type": "choice",
			"title": "Hacker",
			"description": "Your crew's hacker will allow you and your crew to do the heist without having to worry about security cameras and electronic doors. She is a shy nerd who only recently lost her virginity and as such is obsessed with sex. You as the heist leader, decide to teach her the intricacies of sex personally, making her your personal submissive slut. By the time you are done with her training, she wants you to fuck her as she hacks into systems on her laptop. She gets 5% of the heist money.",
			"choices": [
				{
					"name": "Emily Ratajkowski",
					"image": "EmilyRatajkowski/4.jpg",
					"modifier": "+1 Desire",
					"perk": "",
					"description": "Emily was a slut throughout college, however weirdly she only lost her virginity during graduation. She got extra classes from her professors by blowing, flashing and titfucking them, so that she could pass her classes. These extra classes also made her a good hacker, which is always a perk. You fulfil her libido in exchange for her commiting to your illegal activities. You often find her roaming around in lingerie, giving you the \"fuck me eyes\", which get you horny enough to fuck her right then and there."
				},
				{
					"name": "Katherine McNamara",
					"image": "KatherineMcNamara/5.jpg",
					"modifier": "+1 Skill",
					"perk": "",
					"description": "Katherine worked as a hacker for a cybersecurity firm. When she lost her virginity, she went AWOL on her firm and spent all her money, going to parties and hooking up with random college students. You and your partner met her in one of these parties and hooked up with her. Once you found out she had more hacking experience than anyone you knew, you decided to hire her for the crew. Of course, to intice her you give her regular, kinky sex."
				},
				{
					"name": "Natalie Portman",
					"image": "NataliePortman/10.jpg",
					"modifier": "+1 Loyalty",
					"perk": "",
					"description": "Natalie was an older woman who was married to one of your friends who didn't love her. She had never had sex with her husband, so when a burgler came in and fucked her, something awoke inside of her and she realised that she had a submissive kink. As such, once her husband died and his will gave all of his property to you, she offered herself as well. You made her your sex slave and used her hacking skills for heists in exchange for fulfilling her submissive fantasies."
				}
			],
			"pick": 1
		},
		{
			"type": "choice",
			"title": "Seducer",
			"description": "Your crew's seducer will seduce the head of security, allowing your crew to perform the heist while he is distracted. In order to train her for this mission, you make her undergo training simulations, where her and your partner will both try to take you to your bedroom from the bar. Whoever is sucessful get to dominate the other alongside you for the night. Regardless of who wins, you get to have crazy sex with 2 hot women who both want you. She gets 5% of the heist money",
			"choices": [
				{
					"name": "Emilia Clarke",
					"image": "EmiliaClarke/6.jpg",
					"modifier": "+1 Desire",
					"perk": "Unlock Mother of Dragons",
					"description": "Emilia was a high class escort, providing her services to politicians, billionares and rich criminals. You hired her by promising her a share of the heist money, which would be enough to pay her high charges. While she was happy to work for the money, she also had some more baser needs. She explained that part of reason she works as an escort is to get large dicks inside her. When you showed her your huge dick, she agreed to join your crew, before taking off her clothes and riding you in cowgirl."
				},
				{
					"name": "Taylor Swift",
					"image": "TaylorSwift/3.jpg",
					"modifier": "+1 Skill",
					"perk": "",
					"description": "Taylor used to be an agent for the CIA, and as such she was trained in all sorts of seduction techniques. While her skills as a seducer were amazing, her skills in sex were not up to the mark, since generally she would kill her victim after seducing them, rather than actually have sex with them. Luckily, you were able to train her in satisfying men by using your massive cock to stretch out her pussy and train her to make a man cum multiple times."
				},
				{
					"name": "Joey King",
					"image": "JoeyKing/4.jpg",
					"modifier": "+1 Loyalty",
					"perk": "Unlock 1/2 of Sisterly Love",
					"description": "Joey was the daughter of a rich family, and as such was trained in courting men in order to get married. She however, ran away from her family and started making a living by seducing and then robbing rich men. When she tried to rob you after seducing you, you caught her red handed and handcuffed her. You then proceeded to punish her as she coyly moaned for \"Daddy\" to be gentle on her body. Once you punished her she would try and seduce you every night, only to then get punished in the morning."
				}
			],
			"pick": 1
		},
		{
			"type": "photopara",
			"title": "Extra: Mother of Dragons",
			"celeb": {
				"name": "Rose Leslie",
				"image": "RoseLeslie/3.jpg"
			},
			"description": [
				"One day when you were going through a simulation with Emilia, she introduced her friend's daughter, Rose. She informed you that Rose is a virgin who wants to work as a high end escort.",
				"In order to prepare her for the job, she asks you to train her in sex. You oblige and take her to your room. After taking her clothes off, you start with foreplay by sucking on her tits and licking her pussy. You then make her suck your cock.",
				"\"Oh shit, that's so big sir! I don't know if I can take it all in my mouth!\" she says. Seeing this you take a hold of her head by her hair and force your dick down her throat only to hear her gag. You then pick her up by her hair and bend her over.",
				"\"FUCK FUCK THAT FEELS SO GOOD SIR!\" Rose exclaimed as you took her virginity. You then made her cum all over your dick, before cumming deep inside her. Afterwards you spent the whole night covering Rose in cum, before giving her her clothes back and asking her to leave."
			],
			"condition": {
				"conditional": "intersect",
				"a": [
					"Seducer.name"
				],
				"b": [
					"Emilia Clarke"
				]
			}
		},
		{
			"type": "choice",
			"title": "Ninja",
			"description": "Your crew's ninja has the important job of sneaking into the casino vault room and bring the money out. To do this, she needs to be extremely quiet even in stressful situations. To do this you take her to all sorts of public places and fuck her roughly. If she makes a noise or gets caught, you take her home and punish her for failing her training. If she passes her training, you reward her with a creampie and treats of all kind. She gets 5% of the heist money.",
			"choices": [
				{
					"name": "Gal Gadot",
					"image": "GalGadot/11.jpg",
					"modifier": "+1 Desire",
					"perk": "",
					"description": "Gal was a marine in the Israeli military. As the military was dominated by men, she was used to letting her superiors use her body to get ahead. She would often have gangbangs in the showers with the officers in order to get promoted. One day she got caught and was threatened with a court martial. Luckily, she was able to fuck her way out of prison and get out of Israel. She then started working as a theif until she was caught by you. Seeing no way out, she decided to try and fuck her way out with you, only this time she got addicted to your dick."
				},
				{
					"name": "Jamie Chung",
					"image": "JamieChung/3.jpg",
					"modifier": "+1 Skill",
					"perk": "",
					"description": "Jamie was born in China to a deeply conservative family who wanted her to become a warrior. As such she was trained in fighting and flexibility skills from a very young age. When she came of age, her family wed her off to a strong prince who would fuck her roughly every night, until he died in battle. As a widow, she was destined for a boring life, as such she ran away. When she found you, she decided to have sex with you, so that she may remember how her husband fucked her nubile body."
				},
				{
					"name": "Hunter King",
					"image": "HunterKing/3.jpg",
					"modifier": "+1 Loyalty",
					"perk": "Unlock 1/2 of Sisterly Love",
					"description": "Hunter was born in noble family, but was kidnapped and sold into slavery as a little kid. She escaped her enslavers and eventually joined a monastry where she learned the ancient martial arts. Raised by women, she was unable to explore her sexuality with men. This alongside daddy issues, make her extremely vulnerable to getting seduced by people like you. You of course, exploit this fact and keep her loyal to you by fucking her as she begs for \"Daddy's love\" inside her."
				}
			],
			"pick": 1
		},
		{
			"type": "photopara",
			"title": "Extra: Sisterly Love",
			"celeb": {
				"name": "Joey and Hunter King",
				"image": "Threesomes/JoeyKingHunterKing.jpg"
			},
			"description": [
				"One day when you were discussing the heist with your crew, you noticed that your hacker and ninja seemed like they knew each other well. Perhaps a little too well. After the meeting you followed them to see that they are living together.",
				"When you peeped in through the half-closed door, you found them both taking their clothes off before Hunter wore a strap-on and started fucking Joey. \"YES BIG SIS! Make me cum all over you\" Joey exclaimed as her legs started vibrating.",
				"Just as Joey came, Hunter saw you peeping on them and without saying anything, simply used her hand to ask you to join in. Seeing the open invitation, you pulled out your dick and put it inside Joey's ass. \"Daddy! What are you doing here! Please don't stop now I need your cock in my ass daddy!\" Joey said, still recovering from her orgasm.",
				"What followed was you and Hunter giving Joey the time of her life, before Joey and Hunter exchanged positions and you DP'd Hunter. You came inside both their asses and vaginas, and they came 6 times each over your throbbing cock. You three met every week afterwards until the heist was over, to have wet, raw, rough sex."
			],
			"condition": {
				"conditional": "intersect",
				"a": [
					"Ninja.name",
					"Seducer.name"
				],
				"b": [
					"Joey King",
					"Hunter King"
				]
			}
		},
		{
			"type": "choice",
			"title": "Driver",
			"description": "Your crew's driver is responsible for making sure that the entire crew can make it to the casino and get out with the money. To train your driver, you make her drive in all sorts of stressful situations, from you licking her pussy as she drives to forcing her to give you a handjob as with one hand while having the other on the steering. If she passes these tests, you have her part the car in an isolated place so and you get your partner to fuck her. If she fails, you dominate her in the back of the car. She gets 5% of the heist money.",
			"choices": [
				{
					"name": "Lily James",
					"image": "LilyJames/5.jpg",
					"modifier": "+1 Desire",
					"perk": "",
					"description": "Lily was raised in a cult, where she was made to have sex with older men from a very young age. When she grew up, she found herself attracted to these older men, wanting to be their \"Little Princess\". When the cult eventually collapsed, she found herself homeless and without a father figure to pleasure her. You were able to provide her both those things when you found her masterbating in a your car that she stole. You fucked her in that car and she has been your little fuckslut ever since, wanting nothing more than your complete attention and love."
				},
				{
					"name": "Margaret Qualley",
					"image": "MargaretQualley/5.jpg",
					"modifier": "+1 Skill",
					"perk": "",
					"description": "Margaret used to be a racing driver in Belgium, however she quit once her father died in a car accident. While she was from a rich family, her father's death led to the loss of the family fortune to vultures from everywhere. She moved to the US, looking to start a new life, only to fail miserably and take up the job of a taxi driver. When you sat in her taxi, you immediately recognized her and asked her how she came to be in this situation. When she dropped you off, she demanded payment, not in cash but with your cock, which you willingly gave her."
				},
				{
					"name": "Rose Byrne",
					"image": "RoseByrne/2.jpg",
					"modifier": "+1 Loyalty",
					"perk": "Unlock A Friend in Need",
					"description": "Rose had a loving family who cared for her and loved her. However, one day her husband and children died, in a house robbery gone wrong. She decided to extract revenge by going undercover as a getaway driver and killing the men who killed her family. After she got her revenge, she decided to keep working as a theif since the thrill excited her. When you met her, you got her to tell her entire story to you. You offered to make her feel better by giving support, however what she wanted more than that was a cock in her pussy, which you were happy to provide."
				}
			],
			"pick": 1
		},
		{
			"type": "photopara",
			"title": "Extra: A Friend in Need",
			"celeb": {
				"name": "Leighton Meester",
				"image": "LeightonMeester/3.jpg"
			},
			"description": [
				"One day, Rose explained that she would be unable to come to the heist planning meeting, since she has to give her friend a drive. Touched, you told her to attend the meeting with your partner and you would be able to drive Rose's friend around.",
				"When you arrived at the location, you found Rose's friend Leighton, who was extremely hot. After driving her around the city and flirting a bit, you dropped her off at her house, at which point she invited you in. Once inside she called you from her bedroom, where she lay on the bed, completely naked.",
				"\"You like what you see?\" she asks you while playing with her pussy. Without hesitating, you take your clothes off and get on her bed and start making out with her as she gives you a handjob. You then fuck her in sensual missionary while making out with her as she cums all over your dick.",
				"\"OH MY! YOUR DICK IS SO LARGE I FEEL LIKE ITS GONNA ENTER MY UTERUS!\" she says as you pound her petite body. Several creampies later, you fall asleep on her bed. When you wake up, you have breakfast with her as she blows you under the table, before she leaves to catch her flight out of the city."
			],
			"condition": {
				"conditional": "intersect",
				"a": [
					"Driver.name"
				],
				"b": [
					"Rose Byrne"
				]
			}
		},
		{
			"type": "choice",
			"title": "Model",
			"description": "Your crew's model will serve as an excuse for your crew to get into the casino. She has been invited as a guest to the casino for a photoshoot and your crew will appear as her assistants. She agreed to this deal because she was really lonely, and as such you have the important responsibility of making her feel like she is loved by a man. Being lonely, she offers her whole body to you and you accept. You use her as your bathing assistant, as your slutty cook and even as your sex slave. She gets 5% of the heist money.",
			"choices": [
				{
					"name": "Nicola Cavanis",
					"image": "NicolaCavanis/5.jpg",
					"modifier": "+1 Desire",
					"perk": "",
					"description": "Nicola used to be a prude, until she became a lingerie model. When she saw the way people online admired her curvy body, she decided to go full slut and became a nude model on onlyfans. You found her doing a nude shoot in a public bathroom one day and seduced her. Now you get to fuck her and record it to show to the world that she belongs to you and you alone. She in turn gets to be your sugar baby and gets to enjoy being manhandled by you as your massive cock enters her perpetually wet pussy."
				},
				{
					"name": "Alejandra Guilmant",
					"image": "AlejandraGuilmant/1.jpg",
					"modifier": "+1 Skill",
					"perk": "",
					"description": "Alejandra was born in a cartel family in Mexico. As such she was used to getting insane amounts of money and power. She became a swimsuit model to explore the world while also fucking whoever she wanted, whenever she wanted. When you met her at a fashion show, you instantly caught her eye. She called you to her mansion in Guadlajara to have a good time. When you reached you found the whole mansion filled with hot models as she invited you to start the orgy. What proceeded was you fucking all the models multiple times, creating moans loud enough to be heard by the entire city."
				},
				{
					"name": "Miranda Kerr",
					"image": "MirandaKerr/3.jpg",
					"modifier": "+1 Loyalty",
					"perk": "",
					"description": "Miranda was the trophy wife of a rich hollywood actor. She married him solely for his wealth and fame, to get ahead in the modelling industry. However when he got cancelled on twitter and lost all his fame, she divorced him and took half his money. You met her at a party, and being the gold digger that she is she immediately tried to seduce you. You offered to be her sugar daddy as long as she would be your arm candy who you would take to parties to make other men jealous. She agreed and you both sealed the deal with hot, rough sex for the entire night."
				}
			],
			"pick": 1
		},
		{
			"type": "choice",
			"title": "Seller",
			"description": "While the seller is not officially part of your crew, she provides all the equipment and gear your crew needs as well as a place to sell the goods you steal that are not exactly liquid cash. You and the seller have a very long relationship, starting from when you were just a petty theif stealing people watches and jewellery to earn some extra cash. Of course, as with any relationship you have with a woman, you and the seller have regular sex on multiple occasions and have even had threesomes with your partner. In exchange for providing you the materials for the heists, she demands a cut and obviously your cock. She gets 5% of the heist money.",
			"choices": [
				{
					"name": "Elizabeth Olsen",
					"image": "ElizabethOlsen/1.jpg",
					"modifier": "+1 Desire",
					"perk": "",
					"description": "Elizabeth was an orphan and as such grew up in an orphanage. When she became old enough, she earned a scholarship to go study at Oxford, but what she ended up doing there was selling weed and drugs to the students. She established her network from Britain all the way back to America where she met you. While generally she would not sleep with her customers, you were different. You awoke something in her that she didn't even know existed. When you deflowered her, she instantly became addicted to your cock. Even now, outside of business, all she can think about is when you will come and fuck the living shit out of her and breed her."
				},
				{
					"name": "Katy Perry",
					"image": "KatyPerry/4.jpg",
					"modifier": "+1 Skill",
					"perk": "Unlock Black and Pink",
					"description": "Katy was involved in the music industry as a teen but slowly her fame faded away. However, from her contacts in the music industry, and in the sale of substances in her concerts, she was able to set up a reliable trading network. A slut, she can often be found taking many cocks at once while making business deals (she says cum helps her think). However, once she started dealing with you, she realises quality is better than quantity. Your one huge cock is enough to make her feel more pleasure than while getting DP'd in a gangbang. She still fucks people of course but no one can satisfy her like you can and as such she eagerly awaits your arrival in her store."
				},
				{
					"name": "Kaya Scodelario",
					"image": "KayaScodelario/1.jpg",
					"modifier": "+1 Loyalty",
					"perk": "",
					"description": "Kaya was the daughter of a mob boss. As she learned the tools of the trade from a very young age. When her father died, she became the don of the mob, running a large organised crime syndicate. After you both had worked together for a while, you started to realise that she had grown feelings towards you. One day while selling her a necklace, you decided to put it around her neck to show her how beautiful it is. When you were behind her, she took your hands and put them on her boobs and said \"I'm your property sir, please use me.\" You immediately took off your clothes and fucked her right then and there from behind, before cumming deep inside her."
				}
			],
			"pick": 1
		},
		{
			"type": "choice",
			"title": "Extra: Black and Pink",
			"description": "Katy wants to improve her relationship with you and as such she often sets you up with her friends from the music industry. One day she tells you that her friends Jisso, Jennie and Rose from the korean group BlackPink were coming to your city and were looking for some quick and non-commited sex. Since they are often together, they are used to pleasuring each other and don't mind sharing you among all three of them. You obviously said yes and met all of them backstage. After making some small talk, Jisoo took off her top and crawled towards your groin, unbuckled your pants and started blowing you. Soon you had Jisoo blowing you, Jennie making out with you and Rose sucking your balls. You then fucked all three of them in threesomes, where whichever girl came gets replaced by the one waiting for her turn and masterbating on the side. After a fun filled night, you came inside all three of them multiple times and they left for their flights back to Korea, filled with cum.",
			"choices": [
				{
					"name": "Jisoo Kim",
					"image": "JisooKim/1.jpg",
					"modifier": "",
					"perk": "",
					"description": ""
				},
				{
					"name": "Jennie Kim",
					"image": "JennieKim/4.jpg",
					"modifier": "",
					"perk": "",
					"description": ""
				},
				{
					"name": "Roseanne Park",
					"image": "RoseannePark/4.jpg",
					"modifier": "",
					"perk": "",
					"description": ""
				}
			],
			"pick": 0,
			"condition": {
				"conditional": "intersect",
				"a": [
					"Seller.name"
				],
				"b": [
					"Katy Perry"
				]
			}
		},
		{
			"type": "choice",
			"title": "Owner",
			"description": "The owner of the casino is a young, smart and enterprising woman, who will stop at nothing to make sure her ill gotten gains remain safe. You actually knew the owner since you both went to the same high school. You took her virginity in the boys washroom during one of the many steamy after-school dance practices you had. After a while you guys started dating, until her best friend seduced you into cheating on her. Heartbroken, the owner still hates you and wants to exact her revenge on you for what you did to her. (Provides negative stats)",
			"choices": [
				{
					"name": "Brie Larson",
					"image": "BrieLarson/5.jpg",
					"modifier": "-3 Desire",
					"perk": "",
					"description": "Brie was the most popular girl in your high school. When you broke her heart, she decided to become a slutty lingerie model. After a very illustrious and sexy career, she retired young with her millions and opened her casino. This casino serves as a cover for her underground brothel, where she whores herself as well as other girls to rich businessmen for millions. You've been to the brothel many times, making sure to avoid Brie, but everytime you can see that she is clearly waiting for a certain cock to come and give her the pleasure she desires."
				},
				{
					"name": "Margot Robbie",
					"image": "MargotRobbie/2.jpg",
					"modifier": "-3 Skill",
					"perk": "Unlock Espionage",
					"description": "Margot was actually your favorite teacher in school. She was married when she started dating you and when you broke up with her, her sadness caused her to divorce her rich husband. In the divorce she got half of his assets, worth millions and his casino. Now she runs the casino with pinpoint precision, checking everything and everyone that goes in and out of the casino. Still everytime you see her, you can see that she is longing to be fucked from behind by her \"favorite student\" from all those years ago"
				},
				{
					"name": "Natalia Dyer",
					"image": "NataliaDyer/4.jpg",
					"modifier": "-3 Loyalty",
					"perk": "",
					"description": "Natalia was the daughter of a rich oil baron who was too busy to spend any time with her. Raised by her conservative mother, she obviously had many daddy issues. Once she turned 18, she was able to distance herself from her mother, and explore her sexuality, starting with you. After you broke up with her, she went completely sex-sober and hasn't had a cock in her ever since. To make up for the hole you left in her, she put herself to work and established the casino. Still even today, you think she wants to be your little princess."
				}
			],
			"pick": 1
		},
		{
			"type": "photopara",
			"title": "Extra: Espionage",
			"celeb": {
				"name": "Iris and Maude Apatow",
				"image": "Threesomes/IrisApatowMaudeApatow.jpeg"
			},
			"description": [
				"One day you heard a knock on your door. When you went to open it you saw 2 extremely hot young women trying to sell you some cookies. Thinking nothing of it, you invited them in. When your partner came out of the bedroom, she caught them red handed looking into your heist plans.",
				"Your partner immediately arrested and captured them both. When you asked them who had sent them, Maude said that a blonde woman named Margot wanted to know if you were planning to steal from her casino. Seeing as they were both agents of Margot, you couldn't let them go until the heist was over.",
				"You decided to keep them both in the dungeon. You later found out that the 2 actaully loved fucking older men together. Seeing this you pull out your dick and untie them. They quickly get on all fours and start sucking \"Daddy's meat scepter\" as your partner rips off their dresses.",
				"After a while you decide to finally fuck them. You fuck Iris while your partner fucks Maude with a strap-on. They both make out with each other as they get fucked harder and harder. Eventually you are your partner switch slaves and fuck the other one. \"MOMMY AND DADDY PLEASE PUNISH US FOR TRYING TO SPY ON YOU!\" Maude says as you keep spanking her",
				"This goes on every night until the heist is over. Every night you make Maude and Iris scream \"DADDY'S LONG COCK IS THE BEST!\" as they cum all over you and your partner. Once the heist is over, you send them both off, naked and filled with cum to be shamed for the sluts that they are."
			],
			"condition": {
				"conditional": "intersect",
				"a": [
					"Owner.name"
				],
				"b": [
					"Margot Robbie"
				]
			}
		},
		{
			"type": "choice",
			"title": "Rival",
			"description": "Your rival was the girl you cheated on the owner with back in high school. Cold and calculating, she is one of the best theifs there is in the world. She often beats you to many heists and is almost as rich as you are, albeit a lot more lonely. When you two meet each other, she often tries to seduce you, only to stab you in the back and steal your shit. Luckily you are aware of this and put an end to her antics as soon as possible, after fucking her of course.",
			"choices": [
				{
					"name": "Sydney Sweeny",
					"image": "SydneySweeny/4.jpg",
					"modifier": "-2 Desire",
					"perk": "",
					"description": "Sydney was the high school slut back in the day. You are sure she has had more cocks in her than there are grains of sand in an hourglass. Yet everytime you enter her pussy, it feels tight and virgin. She became a theif after she graduated high school to get away from the boring life her parents had planned for her. She generally uses her wealth to hire giggolo sugar babies who she dommes and bosses around the house, however with you she is extremely submissive, partly because she likes it and partly because you intimidate her."
				},
				{
					"name": "Madelaine Petsch",
					"image": "MadelainePetsch/4.jpg",
					"modifier": "-2 Skill",
					"perk": "",
					"description": "Madelaine was the cheer captain back in high school. As such, she had dated all the boys on the sports team. When you cheated on the owner with her, you realised quickly that she was in fact a kleptomaniac. She would date all the sports team members, only to steal their passwords, keycodes and keys. She would then break into their house at night and steal all their valuables, selling them to buy herself new things. When she graduated, she continued stealing things from people until she got to the point shes at right now."
				},
				{
					"name": "Sophie Turner",
					"image": "SophieTurner/5.jpg",
					"modifier": "-2 Loyalty",
					"perk": "",
					"description": "Sophie was a rich brat who wanted everything and everyone to be hers. As such she made you cheat on the owner to take you as hers. She wanted to date you and eventually marry you, however you broke it off once you broke up with the owner. Still she longs to \"capture\" you and make you hers forever. To please you, she is willing to go through with any of your kinks, so long as the people know that you are hers and that she is yours. She thinks this will get you to finally like her enough to be with her, however it just allows you to use her for kinky sex"
				}
			],
			"pick": 1
		},
		{
			"type": "choice",
			"title": "Cop",
			"description": "The commissioner of police of the country, the cop has the important duty of stopping your heists and arresting you. Luckily she is also very willing to accept bribes, in both sex and money. Often you find her calling you for a top-up on her bribes, which you are more than happy to provide with your cock. In exchange she tells you exactly what the police are going to do to thwart your plans as well as make plans that ensure you and your crew won't get caught during the heist.",
			"choices": [
				{
					"name": "Debby Ryan",
					"image": "DebbyRyan/3.jpg",
					"modifier": "-1 Desire",
					"perk": "",
					"description": "Debby was made the commissioner of police simply because her father was the prime minister and had put her in the position to set her right. What he didn't know was that Debby would abuse her position to have all sorts of criminals please her and her fellow officers. Debby often offers hot criminals their freedom, in exchange for making her cum everyday for a week. When she gave you the same deal, you were able to make her cum 10 times on the first day, prompting her to free you and giving you free access to her house to come and fuck her at anytime."
				},
				{
					"name": "Amber Heard",
					"image": "AmberHeard/5.jpg",
					"modifier": "-1 Skill",
					"perk": "",
					"description": "Amber was the top graduate of her batch at the police academy. She is a skilled detective and a rough fighter, however she was unable to get the promotions she desired in the police because she would not take bribes. Running out of options, she started taking bribes from all sorts of people to both get the promotion she desired. When she met you, she asked you to fill her pockets with cash, but you suggested filling her pussy with your cum. She jokingly said that you couldn't get her off. That night you showed her just how wrong she was, making her cum 12 times."
				},
				{
					"name": "Alison Brie",
					"image": "AlisonBrie/11.jpg",
					"modifier": "-1 Loyalty",
					"perk": "",
					"description": "Alison was a nerd who got the promotion to commissioner because no one else wanted it. She was a great planner but in any field situation would find herself captured. Such a situation arose when she tried to catch you in one of your heists. After capturing her, you fucked her virgin pussy, and making her addicted to your cock. When you let her go, she misinformed the police allowing you to get away with your heists. Every week, she shows up at your door, with handcuffs, so that you can cuff her and fuck her from behind as she was helpless to stop you and your cock."
				}
			],
			"pick": 1
		},
		{
			"type": "ending",
			"traits": {
				"Desire": {
					"maximum": true,
					"upper": 10,
					"lower": 1
				},
				"Skill": {
					"maximum": false,
					"upper": 10,
					"lower": 0
				},
				"Loyalty": {
					"maximum": false,
					"upper": 10,
					"lower": 0
				}
			},
			"title": "Desire Success",
			"description": "Your heist succeeds and your crew shares the heist money. Your crew, now addicted to your cock, joined your harem. You marry your partner and she serves as your harem manager, fucking your harem, with or without you.",
			"data": [
				{
					"type": "photopara",
					"title": "Extra: Reconcilliation",
					"celeb": {
						"name": "Brie Larson",
						"image": "BrieLarson/7.jpg"
					},
					"description": [
						"After the heist, Brie showed up at your door, now that she was broke. \"I know you robbed me! I can't prove it but I know it!\" she said",
						"\"Regardless, I had to declare bankruptcy and all my investors are after me now. You are the only one who can save me. So please let me stay with you for a while.\" she demanded.",
						"Interested you told her that she could stay as long as she stayed quiet about the heist, let you fuck her freeuse whenever she wanted and serve as your maid for a month.",
						"Out of options she agreed and you and your harem made her your fuckpet. After her maid punishment was over, you took her as your second wife and got rid of her debt.",
						"You now have both her and your partners as bedwarmers every night. When you would wake up, Brie would give you a morning blowjob as you made out with your partner. All three of you would then spend the day fucking your harem"
					],
					"condition": {
						"conditional": "intersect",
						"a": [
							"Owner.name"
						],
						"b": [
							"Brie Larson"
						]
					}
				},
				{
					"type": "choice",
					"title": "Sugar-Babies",
					"description": "Your partner comes up to you one day and introduces two of her \"friends\" who are college students. She explains that her friends are broke and need money to live. As you are rich, its obvious that she wants you to help her friends, but being the businessman you are you need something in return. Hearing the two girls start making out with each other and they both start stripping. After you fill them both with cum, you make them sign a sugar-baby contract, officially making them your ward and allowing you to use her however you desire, in exchange for room and board in your mansion. (Top row are undergraduates, Bottom row is postgraduates. You can mix and match but the text might not make sense)",
					"pick": 2,
					"choices": [
						{
							"name": "Madison Beer",
							"image": "MadisonBeer/1.jpg"
						},
						{
							"name": "Cara Delevingne",
							"image": "CaraDelevingne/2.jpg"
						},
						{
							"name": "Jordyn Jones",
							"image": "JordynJones/3.jpg"
						},
						{
							"name": "Zooey Deschanel",
							"image": "ZooeyDeschanel/2.jpg"
						},
						{
							"name": "Jennifer Lawrence",
							"image": "JenniferLawrence/2.jpg"
						},
						{
							"name": "Elizabeth Gillies",
							"image": "ElizabethGillies/5.jpg"
						}
					]
				}
			]
		},
		{
			"type": "ending",
			"traits": {
				"Desire": {
					"maximum": false,
					"upper": 10,
					"lower": 0
				},
				"Skill": {
					"maximum": true,
					"upper": 10,
					"lower": 1
				},
				"Loyalty": {
					"maximum": false,
					"upper": 10,
					"lower": 0
				}
			},
			"title": "Skill Success",
			"description": "Your heist succeeds and your crew shares the heist money. Your crew, in hopes of doing more heists with you, joined your harem. You marry your partner and she serves as your harem manager, fucking your harem, with or without you.",
			"data": [
				{
					"type": "photopara",
					"title": "Extra: Reconcilliation",
					"celeb": {
						"name": "Margot Robbie",
						"image": "MargotRobbie/1.jpg"
					},
					"description": [
						"After the heist, Margot showed up at your door, now that she was broke. \"I know you robbed me! I can't prove it but I know it!\" she said",
						"\"Regardless, I had to declare bankruptcy and all my investors are after me now. You are the only one who can save me. So please let me stay with you for a while.\" she demanded.",
						"Interested you told her that she could stay as long as she stayed quiet about the heist, let you fuck her freeuse whenever she wanted and serve as your concubine for a month.",
						"Out of options she agreed and you made her your fuckpet. After her concubine punishment was over, you took her as your second wife and got rid of her debt.",
						"You now have both her and your partners as bedwarmers every night. When you would wake up, Margot would give you a morning titjob as you made out with your partner. All three of you would then spend the day fucking your harem"
					],
					"condition": {
						"conditional": "intersect",
						"a": [
							"Owner.name"
						],
						"b": [
							"Margot Robbie"
						]
					}
				},
				{
					"type": "choice",
					"title": "Athelete",
					"description": "After the heist, you receive an email from two local atheletes. They are looking for sporting facilities in the region where they can train for the olympics. Being rich, you offer your mansion which is equiped with the latest equipment. You tell them that if they want to use your mansion's facilities they will have to pay for them in kind. Hearing this they take off their sports bras and start making out with you. After you fill them up with cum, you hire them as personal trainers and a recruited atheletes who are free to use the facilities on your mansion, in exchange for regular private \"excercise\" sessions with you. (Top row are college atheletes, Bottom row are MILF atheletes. You can mix and match but the text might not make sense)",
					"pick": 2,
					"choices": [
						{
							"name": "Alexandra Daddario",
							"image": "AlexandraDaddario/2.jpg"
						},
						{
							"name": "Disha Patani",
							"image": "DishaPatani/1.jpg"
						},
						{
							"name": "Hailee Steinfeld",
							"image": "HaileeSteinfeld/2.jpg"
						},
						{
							"name": "Jennifer Connelly",
							"image": "JenniferConnelly/3.jpg"
						},
						{
							"name": "Jewel Staite",
							"image": "JewelStaite/3.jpg"
						},
						{
							"name": "Yanet Garcia",
							"image": "YanetGarcia/2.jpg"
						}
					]
				}
			]
		},
		{
			"type": "ending",
			"traits": {
				"Desire": {
					"maximum": false,
					"upper": 10,
					"lower": 0
				},
				"Skill": {
					"maximum": false,
					"upper": 10,
					"lower": 0
				},
				"Loyalty": {
					"maximum": true,
					"upper": 10,
					"lower": 1
				}
			},
			"title": "Loyalty Success",
			"description": "Your heist succeeds and your crew shares the heist money. Your crew, loyal to you with all their hearts, joined your harem. You marry your partner and she serves as your harem manager, fucking your harem, with or without you.",
			"data": [
				{
					"type": "photopara",
					"title": "Extra: Reconcilliation",
					"celeb": {
						"name": "Natalia Dyer",
						"image": "NataliaDyer/3.jpg"
					},
					"description": [
						"After the heist, Natalia showed up at your door, now that she was broke. \"I know you robbed me! I can't prove it but I know it!\" she said",
						"\"Regardless, I had to declare bankruptcy and all my investors are after me now. You are the only one who can save me. So please let me stay with you for a while.\" she demanded.",
						"Interested you told her that she could stay as long as she stayed quiet about the heist, let you fuck her freeuse whenever she wanted and serve as your cumbucket for a month.",
						"Out of options she agreed and you made her your cumbucket. After her cumbucket punishment was over, you took her as your second wife and got rid of her debt.",
						"You now have both her and your partners as bedwarmers every night. When you would wake up, Natalia would fuck you sweetly in cowgirl as you made out with your partner. All three of you would then spend the day fucking your harem"
					],
					"condition": {
						"conditional": "intersect",
						"a": [
							"Owner.name"
						],
						"b": [
							"Natalia Dyer"
						]
					}
				},
				{
					"type": "choice",
					"title": "Stepfamily",
					"description": "One day your stepmom and stepsis gives you a surprise visit. When they find out about your harem, they are at first repulsed. However, at night, your stepmother and stepsister come to your room and say they want to know how one can join the harem. You immediately start groping your stepmom and making out with your stepsister, explaining to the two of them that they just need to have sex with you to join. That night you took your sister's virginity and made her a woman, while your stepmom masterbated and made out with you. Consequently, they decided to stay with you and live a life of pleasure. (Top row is stepmom and Bottom row is stepsister. You can mix and match but the text might not make sense)",
					"pick": 2,
					"choices": [
						{
							"name": "Rachel McAdams",
							"image": "RachelMcAdams/2.jpg"
						},
						{
							"name": "Mary E Winstead",
							"image": "MaryWinstead/1.jpg"
						},
						{
							"name": "Felicity Jones",
							"image": "FelicityJones/12.jpg"
						},
						{
							"name": "Deborah Ann Woll",
							"image": "DeborahAnnWoll/7.jpg"
						},
						{
							"name": "Emma Stone",
							"image": "EmmaStone/1.jpg"
						},
						{
							"name": "Jia Lissa",
							"image": "JiaLissa/1.jpg"
						}
					]
				}
			]
		},
		{
			"type": "ending",
			"traits": {
				"Desire": {
					"maximum": false,
					"upper": 0,
					"lower": -10
				},
				"Skill": {
					"maximum": false,
					"upper": 0,
					"lower": -10
				},
				"Loyalty": {
					"maximum": true,
					"upper": 0,
					"lower": -10
				}
			},
			"title": "Failure",
			"description": "Your heist fails and your crew is arrested. Luckily, you were able to manipulate the law so that you could escape scot-free. Unfortunately, the Owner caught wind of your plans and sent out a hit crew after you. They captured you and took you to the owner for her to use you as fuckpet. She dominates you day and night, not letting you cum and spanking the shit out of you. Eventually, she gets bored with you and has you locked in a casino vault to starve to death.",
			"data": []
		}
	]
}